## Installing and importing pandas library

In [10]:
pip install pandas

Requirement already satisfied: pandas in c:\users\test\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\users\test\anaconda3\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\test\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\test\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\test\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

## Reading raw data from a csv file into a dataframe

In [84]:
data_df = pd.read_csv("E:\Wolftech\wolftech-learning-tirtharaj\data-science-adv-python\CarPricesData.csv",encoding="latin-1")

In [121]:
# print(data_df)

In [86]:
print(data_df.head(n=5))

   Price   Age     KM FuelType  HP  MetColor  Automatic      CC  Doors  Weight
0  13500  23.0  46986   Diesel  90         1          0  2000.0      3  1165.0
1  13750  23.0  72937   Diesel  90         1          0  2000.0      3  1165.0
2  13950  24.0  41711   Diesel  90         1          0  2000.0      3  1165.0
3  14950  26.0  48000   Diesel  90         0          0  2000.0      3  1165.0
4  13750  30.0  38500   Diesel  90         0          0  2000.0      3  1170.0

In [87]:
print(data_df.shape)
x = data_df.shape

(1436, 10)

## View the no. of rows and columns in the dataframe

In [88]:
print('The number of rows is:', x[0])
print('The number of columns is:', x[1])

The number of rows is: 1436
The number of columns is: 10

In [89]:
data_df = data_df.drop_duplicates()

In [90]:
y = data_df.shape
print(y)

(1435, 10)

In [91]:
print('No of duplicate rows deleted:', x[0]-y[0])

No of duplicate rows deleted: 1

## Viewing data summary using info(), describe() and nunique()

In [122]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1434 non-null   float64
 2   KM         1436 non-null   int64
 3   FuelType   1432 non-null   object
 4   HP         1436 non-null   int64
 5   MetColor   1436 non-null   int64
 6   Automatic  1436 non-null   int64
 7   CC         1434 non-null   float64
 8   Doors      1436 non-null   int64
 9   Weight     1434 non-null   float64
 10  Cylinders  1436 non-null   int64
 11  Make       1436 non-null   object
dtypes: float64(3), int64(7), object(2)
memory usage: 145.8+ KB

In [123]:
data_df.describe(include='all')

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Cylinders,Make
count,1436.000000,1434.000000,1436.000000,1432,1436.000000,1436.000000,1436.000000,1434.000000,1436.000000,1434.000000,1436.000000,1436
unique,NaN,NaN,NaN,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11
top,NaN,NaN,NaN,Petrol,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Bugatti
freq,NaN,NaN,NaN,1261,NaN,NaN,NaN,NaN,NaN,NaN,NaN,144
mean,10726.506964,56.002092,68529.949861,NaN,101.463092,0.674791,0.056407,1567.688285,4.031337,1072.940725,7.260446,NaN
std,3613.692208,18.551206,37511.540050,NaN,15.016160,0.468616,0.230786,190.623650,0.953844,57.389549,3.282579,NaN
min,4350.000000,1.000000,1.000000,NaN,60.000000,0.000000,0.000000,1300.000000,2.000000,1000.000000,3.000000,NaN
25%,8450.000000,44.000000,43000.000000,NaN,89.000000,0.000000,0.000000,1400.000000,3.000000,1040.000000,3.000000,NaN
50%,9900.000000,61.000000,63389.500000,NaN,110.000000,1.000000,0.000000,1600.000000,4.000000,1070.000000,8.000000,NaN
75%,11950.000000,70.000000,87020.750000,NaN,110.000000,1.000000,0.000000,1600.000000,5.000000,1085.000000,12.000000,NaN
max,32500.000000,80.000000,243000.000000,NaN,192.000000,1.000000,1.000000,3000.000000,5.000000,1970.000000,12.000000,NaN

In [124]:
data_df.nunique()

Price         236
Age            77
KM           1264
FuelType        3
HP             13
MetColor        2
Automatic       2
CC             13
Doors           4
Weight         60
Cylinders       4
Make           11
dtype: int64

## Classifying numerical and categorical columns

In [125]:
num_cols = ['Price', 'Age', 'KM', 'HP', 'Weight', 'CC']
cat_cols = ['Doors', 'MetColor', 'Automatic', 'Cylinders','Make', 'FuelType']

## Controlling view options

In [80]:
# pd.options.display.max_columns=10
# pd.set_option('max_rows',15)

In [120]:
# data_df

## Adding a row - using append()

In [99]:
df_cols = ['Price','Age','KM','FuelType','HP','MetColor','Automatic','CC','Doors','Weight']
# new_row = pd.DataFrame(data=[[13750, 30.0,38500,'Diesel',90,0,0,2000.0,3,1170.0]], columns=df_cols)
data_df = data_df.append(new_row, ignore_index=False)

In [102]:
another_row = pd.DataFrame(data=[[13600, 28.0,32500,'Petrol',60,1,0,2500.0,5,1070.0]], columns=df_cols)

In [105]:
data_df = data_df.append(another_row, ignore_index=True)

In [106]:
print(data_df.tail(n=5))

      Price   Age     KM FuelType   HP  MetColor  Automatic      CC  Doors  \
1434   6950  76.0      1   Petrol  110         0          0  1600.0      5
1435  13750  30.0  38500   Diesel   90         0          0  2000.0      3
1436  13750  30.0  38500   Diesel   90         0          0  2000.0      3
1437  13600  28.0  32500   Petrol   60         1          0  2500.0      5
1438  13600  28.0  32500   Petrol   60         1          0  2500.0      5

      Weight
1434  1114.0
1435  1170.0
1436  1170.0
1437  1070.0
1438  1070.0

## Adding a row - using concat()

In [3]:
data_df = pd.read_csv("E:\Wolftech\wolftech-learning-tirtharaj\data-science-adv-python\CarPricesData.csv",encoding="latin-1")
data_df = data_df.drop_duplicates()

In [8]:
df_cols = ['Price','Age','KM','FuelType','HP','MetColor','Automatic','CC','Doors','Weight']
plus_row = pd.DataFrame(data=[[18750, 30.0,8500,'Petrol',60,1,1,3000.0,2,1970.0]], columns=df_cols)

In [9]:
data_df = pd.concat([data_df,plus_row], ignore_index=True)

In [10]:
data_df = data_df.drop_duplicates()
print(data_df.tail(n=6))

      Price   Age     KM FuelType   HP  MetColor  Automatic      CC  Doors  \
1430   7500  69.0  20544   Petrol   86         1          0  1300.0      3
1431  10845  72.0  19000   Petrol   86         0          0  1300.0      3
1432   8500  71.0  17016   Petrol   86         0          0  1300.0      3
1433   7250  70.0  16916   Petrol   86         1          0  1300.0      3
1434   6950  76.0      1   Petrol  110         0          0  1600.0      5
1435  18750  30.0   8500   Petrol   60         1          1  3000.0      2

      Weight  Cylinders
1430  1025.0        8.0
1431  1015.0        8.0
1432  1015.0       12.0
1433  1015.0       12.0
1434  1114.0       12.0
1435  1970.0        NaN

## Adding a numerical column

In [12]:
import random

In [13]:
Cylinders = []
cyl_count = [3,6,8,12]
for i in range(len(data_df)):
    Cylinders.append(random.choice(cyl_count))

In [142]:
# Cylinders

In [14]:
data_df['Cylinders']=Cylinders

In [18]:
data_df

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Cylinders
0,13500,23.0,46986,Diesel,90,1,0,2000.0,3,1165.0,6
1,13750,23.0,72937,Diesel,90,1,0,2000.0,3,1165.0,3
2,13950,24.0,41711,Diesel,90,1,0,2000.0,3,1165.0,12
3,14950,26.0,48000,Diesel,90,0,0,2000.0,3,1165.0,12
4,13750,30.0,38500,Diesel,90,0,0,2000.0,3,1170.0,12
...,...,...,...,...,...,...,...,...,...,...,...
1431,10845,72.0,19000,Petrol,86,0,0,1300.0,3,1015.0,12
1432,8500,71.0,17016,Petrol,86,0,0,1300.0,3,1015.0,12
1433,7250,70.0,16916,Petrol,86,1,0,1300.0,3,1015.0,6
1434,6950,76.0,1,Petrol,110,0,0,1600.0,5,1114.0,12
1435,18750,30.0,8500,Petrol,60,1,1,3000.0,2,1970.0,8

In [23]:
df_cols = ['Price','Age','KM','FuelType','HP','MetColor','Automatic','CC','Doors','Weight'] + ['Cylinders']

In [24]:
df_cols

['Price',
 'Age',
 'KM',
 'FuelType',
 'HP',
 'MetColor',
 'Automatic',
 'CC',
 'Doors',
 'Weight',
 'Cylinders']

In [42]:
# print(data_df[df_cols].iloc[0:,0:11])

      Price   Age     KM FuelType   HP  MetColor  Automatic      CC  Doors  \
0     13500  23.0  46986   Diesel   90         1          0  2000.0      3
1     13750  23.0  72937   Diesel   90         1          0  2000.0      3
2     13950  24.0  41711   Diesel   90         1          0  2000.0      3
3     14950  26.0  48000   Diesel   90         0          0  2000.0      3
4     13750  30.0  38500   Diesel   90         0          0  2000.0      3
...     ...   ...    ...      ...  ...       ...        ...     ...    ...
1431  10845  72.0  19000   Petrol   86         0          0  1300.0      3
1432   8500  71.0  17016   Petrol   86         0          0  1300.0      3
1433   7250  70.0  16916   Petrol   86         1          0  1300.0      3
1434   6950  76.0      1   Petrol  110         0          0  1600.0      5
1435  18750  30.0   8500   Petrol   60         1          1  3000.0      2

      Weight  Cylinders
0     1165.0          6
1     1165.0          3
2     1165.0         12
3     1165.0         12
4     1170.0         12
...      ...        ...
1431  1015.0         12
1432  1015.0         12
1433  1015.0          6
1434  1114.0         12
1435  1970.0          8

[1436 rows x 11 columns]

## Adding a categorical column

In [114]:
Make = []
Make_catalogue = ['Alfa Romeo','Bugatti','Chevrolet','Dodge','Eicher Motors','Ford','GM','Hyundai', 'Isuzu', 'Jaguar', 'Kia']
for i in range(len(data_df)):
    Make.append(random.choice(Make_catalogue))

In [117]:
# Make

In [115]:
data_df['Make']=Make

In [119]:
data_df.head(n=15)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Cylinders,Make
0,13500,23.0,46986,Diesel,90,1,0,2000.0,3,1165.0,6,Eicher Motors
1,13750,23.0,72937,Diesel,90,1,0,2000.0,3,1165.0,3,Chevrolet
2,13950,24.0,41711,Diesel,90,1,0,2000.0,3,1165.0,12,Kia
3,14950,26.0,48000,Diesel,90,0,0,2000.0,3,1165.0,12,Bugatti
4,13750,30.0,38500,Diesel,90,0,0,2000.0,3,1170.0,12,GM
5,12950,32.0,61000,Diesel,90,0,0,2000.0,3,1170.0,6,Dodge
6,16900,27.0,94612,Diesel,90,1,0,2000.0,3,1245.0,12,Alfa Romeo
7,18600,30.0,75889,Diesel,90,1,0,2000.0,3,1245.0,8,Isuzu
8,21500,27.0,19700,Petrol,192,0,0,1800.0,3,1185.0,6,GM
9,12950,23.0,71138,Diesel,69,0,0,1900.0,3,1105.0,8,Dodge
10,20950,25.0,31461,Petrol,192,0,0,1800.0,3,1185.0,8,Alfa Romeo
11,19950,22.0,43610,Petrol,192,0,0,1800.0,3,1185.0,8,Dodge
12,19600,25.0,32189,Petrol,192,0,0,1800.0,3,1185.0,12,Hyundai
13,21500,31.0,23000,Petrol,192,1,0,1800.0,3,1185.0,12,Dodge
14,22500,32.0,34131,NaN,192,1,0,1800.0,3,1185.0,8,GM

## Creating a subset dataframe

In [47]:
dwarf_df = data_df.iloc[4:6,6:11]

In [48]:
dwarf_df

   Automatic      CC  Doors  Weight  Cylinders
4          0  2000.0      3  1170.0         12
5          0  2000.0      3  1170.0          6

In [50]:
minion_df = data_df.iloc[[0,1,2,3,4,5],3:5]

In [51]:
minion_df

  FuelType  HP
0   Diesel  90
1   Diesel  90
2   Diesel  90
3   Diesel  90
4   Diesel  90
5   Diesel  90

## Delete any row from dataframe using drop(), index()

In [92]:
example_sub_df = data_df.iloc[0:6,0:6]

In [64]:
example_sub_df

   Price   Age     KM FuelType  HP  MetColor
0  13500  23.0  46986   Diesel  90         1
1  13750  23.0  72937   Diesel  90         1
2  13950  24.0  41711   Diesel  90         1
3  14950  26.0  48000   Diesel  90         0
4  13750  30.0  38500   Diesel  90         0
5  12950  32.0  61000   Diesel  90         0

### Delete last row

In [96]:
example_sub_df.drop(index=example_sub_df.index[-1], axis=0, inplace=True)

In [97]:
example_sub_df

   Price   Age     KM FuelType  HP  MetColor
0  13500  23.0  46986   Diesel  90         1
1  13750  23.0  72937   Diesel  90         1
3  14950  26.0  48000   Diesel  90         0
4  13750  30.0  38500   Diesel  90         0

### Delete 3rd row

In [94]:
example_sub_df.drop(index=example_sub_df.index[2], axis=0, inplace=True)

In [95]:
example_sub_df

   Price   Age     KM FuelType  HP  MetColor
0  13500  23.0  46986   Diesel  90         1
1  13750  23.0  72937   Diesel  90         1
3  14950  26.0  48000   Diesel  90         0
4  13750  30.0  38500   Diesel  90         0
5  12950  32.0  61000   Diesel  90         0

In [83]:
# example_sub_df = pd.DataFrame(example_sub_df).sort_index()

### Deleting last column

#### For a long dataset its cumbersome to go and find the column number

In [106]:
# This gives the last column, in our case last is 6th column, i.e 5th index
# example_sub_df.shape[1]

In [112]:
# It's MetColor column which is 6th and at 5th index and it will be dropped
# x = example_sub_df.shape[1]

In [103]:
example_sub_df.drop(example_sub_df.columns[x-1], axis=1, inplace=True)

In [104]:
# You can see MetColor is gone
# example_sub_df

   Price   Age     KM FuelType  HP
0  13500  23.0  46986   Diesel  90
1  13750  23.0  72937   Diesel  90
3  14950  26.0  48000   Diesel  90
4  13750  30.0  38500   Diesel  90

### Deleting 3rd column

In [109]:
# 3rd column means 2nd index - i.e KM will be dropped
# example_sub_df.drop(example_sub_df.columns[2], axis=1, inplace=True)

In [113]:
# You can see KM is gone!
example_sub_df

   Price   Age FuelType  HP
0  13500  23.0   Diesel  90
1  13750  23.0   Diesel  90
3  14950  26.0   Diesel  90
4  13750  30.0   Diesel  90

## Deleting HP column

In [129]:
example_sub_df.drop(['HP'], axis=1, inplace=True)

In [130]:
example_sub_df

   Price   Age FuelType
0  13500  23.0   Diesel
1  13750  23.0   Diesel
3  14950  26.0   Diesel
4  13750  30.0   Diesel

# Date handling

In [3]:
medical_table = pd.DataFrame()

## A project to create a column with randomized date values

### A. Converting datetime indices to string

#### First creating a data structure of 100 datetime indices

In [6]:
Date_Of_Mfg = [] 
x = pd.date_range('11/12/2022', periods = 100, freq = 'D')

#### Then converting the datetime indices data structure into a list

In [24]:
xl = x.to_list()

In [29]:
len(xl)

100

#### Then stringifying the listified datetime indices values and dumping them in a new list

In [41]:
date_set = []
for i in range(len(xl)):
    date_set.append(str(xl[i]))

In [49]:
date_set

['2022-11-12 00:00:00',
 '2022-11-13 00:00:00',
 '2022-11-14 00:00:00',
 '2022-11-15 00:00:00',
 '2022-11-16 00:00:00',
 '2022-11-17 00:00:00',
 '2022-11-18 00:00:00',
 '2022-11-19 00:00:00',
 '2022-11-20 00:00:00',
 '2022-11-21 00:00:00',
 '2022-11-22 00:00:00',
 '2022-11-23 00:00:00',
 '2022-11-24 00:00:00',
 '2022-11-25 00:00:00',
 '2022-11-26 00:00:00',
 '2022-11-27 00:00:00',
 '2022-11-28 00:00:00',
 '2022-11-29 00:00:00',
 '2022-11-30 00:00:00',
 '2022-12-01 00:00:00',
 '2022-12-02 00:00:00',
 '2022-12-03 00:00:00',
 '2022-12-04 00:00:00',
 '2022-12-05 00:00:00',
 '2022-12-06 00:00:00',
 '2022-12-07 00:00:00',
 '2022-12-08 00:00:00',
 '2022-12-09 00:00:00',
 '2022-12-10 00:00:00',
 '2022-12-11 00:00:00',
 '2022-12-12 00:00:00',
 '2022-12-13 00:00:00',
 '2022-12-14 00:00:00',
 '2022-12-15 00:00:00',
 '2022-12-16 00:00:00',
 '2022-12-17 00:00:00',
 '2022-12-18 00:00:00',
 '2022-12-19 00:00:00',
 '2022-12-20 00:00:00',
 '2022-12-21 00:00:00',
 '2022-12-22 00:00:00',
 '2022-12-23 00:00:00',
 '2022-12-24 00:00:00',
 '2022-12-25 00:00:00',
 '2022-12-26 00:00:00',
 '2022-12-27 00:00:00',
 '2022-12-28 00:00:00',
 '2022-12-29 00:00:00',
 '2022-12-30 00:00:00',
 '2022-12-31 00:00:00',
 '2023-01-01 00:00:00',
 '2023-01-02 00:00:00',
 '2023-01-03 00:00:00',
 '2023-01-04 00:00:00',
 '2023-01-05 00:00:00',
 '2023-01-06 00:00:00',
 '2023-01-07 00:00:00',
 '2023-01-08 00:00:00',
 '2023-01-09 00:00:00',
 '2023-01-10 00:00:00',
 '2023-01-11 00:00:00',
 '2023-01-12 00:00:00',
 '2023-01-13 00:00:00',
 '2023-01-14 00:00:00',
 '2023-01-15 00:00:00',
 '2023-01-16 00:00:00',
 '2023-01-17 00:00:00',
 '2023-01-18 00:00:00',
 '2023-01-19 00:00:00',
 '2023-01-20 00:00:00',
 '2023-01-21 00:00:00',
 '2023-01-22 00:00:00',
 '2023-01-23 00:00:00',
 '2023-01-24 00:00:00',
 '2023-01-25 00:00:00',
 '2023-01-26 00:00:00',
 '2023-01-27 00:00:00',
 '2023-01-28 00:00:00',
 '2023-01-29 00:00:00',
 '2023-01-30 00:00:00',
 '2023-01-31 00:00:00',
 '2023-02-01 00:00:00',
 '2023-02-02 00:00:00',
 '2023-02-03 00:00:00',
 '2023-02-04 00:00:00',
 '2023-02-05 00:00:00',
 '2023-02-06 00:00:00',
 '2023-02-07 00:00:00',
 '2023-02-08 00:00:00',
 '2023-02-09 00:00:00',
 '2023-02-10 00:00:00',
 '2023-02-11 00:00:00',
 '2023-02-12 00:00:00',
 '2023-02-13 00:00:00',
 '2023-02-14 00:00:00',
 '2023-02-15 00:00:00',
 '2023-02-16 00:00:00',
 '2023-02-17 00:00:00',
 '2023-02-18 00:00:00',
 '2023-02-19 00:00:00']

In [45]:
type(date_set)

list

### B. Now creating another new list to contain randomized arrangement of dates

In [46]:
Date_Of_Mfg = []
for d in range(len(date_set)):
    Date_Of_Mfg.append(random.choice(date_set))

In [47]:
Date_Of_Mfg

['2022-11-13 00:00:00',
 '2023-01-03 00:00:00',
 '2023-01-08 00:00:00',
 '2022-11-30 00:00:00',
 '2022-12-09 00:00:00',
 '2023-02-01 00:00:00',
 '2023-01-11 00:00:00',
 '2022-11-23 00:00:00',
 '2023-02-13 00:00:00',
 '2022-12-09 00:00:00',
 '2023-01-23 00:00:00',
 '2022-11-26 00:00:00',
 '2022-11-23 00:00:00',
 '2022-11-18 00:00:00',
 '2022-11-13 00:00:00',
 '2023-01-28 00:00:00',
 '2023-01-31 00:00:00',
 '2023-02-07 00:00:00',
 '2023-01-17 00:00:00',
 '2023-02-11 00:00:00',
 '2023-01-27 00:00:00',
 '2023-01-06 00:00:00',
 '2023-01-31 00:00:00',
 '2023-01-18 00:00:00',
 '2023-01-08 00:00:00',
 '2023-01-23 00:00:00',
 '2023-02-17 00:00:00',
 '2022-11-21 00:00:00',
 '2022-12-06 00:00:00',
 '2022-12-05 00:00:00',
 '2023-01-03 00:00:00',
 '2023-01-02 00:00:00',
 '2022-12-03 00:00:00',
 '2023-01-10 00:00:00',
 '2023-01-27 00:00:00',
 '2023-01-17 00:00:00',
 '2022-12-15 00:00:00',
 '2023-01-05 00:00:00',
 '2022-12-27 00:00:00',
 '2023-01-12 00:00:00',
 '2023-02-19 00:00:00',
 '2022-11-12 00:00:00',
 '2023-01-05 00:00:00',
 '2022-12-23 00:00:00',
 '2023-01-24 00:00:00',
 '2022-11-29 00:00:00',
 '2022-12-11 00:00:00',
 '2022-12-07 00:00:00',
 '2022-12-24 00:00:00',
 '2023-01-16 00:00:00',
 '2022-12-31 00:00:00',
 '2022-12-07 00:00:00',
 '2022-11-13 00:00:00',
 '2022-12-10 00:00:00',
 '2023-01-09 00:00:00',
 '2023-01-10 00:00:00',
 '2023-01-26 00:00:00',
 '2022-12-13 00:00:00',
 '2023-01-29 00:00:00',
 '2023-01-04 00:00:00',
 '2023-02-15 00:00:00',
 '2023-02-17 00:00:00',
 '2023-01-29 00:00:00',
 '2022-11-13 00:00:00',
 '2023-01-02 00:00:00',
 '2023-01-17 00:00:00',
 '2023-01-02 00:00:00',
 '2022-12-22 00:00:00',
 '2022-11-30 00:00:00',
 '2023-02-09 00:00:00',
 '2022-11-29 00:00:00',
 '2023-01-21 00:00:00',
 '2022-11-19 00:00:00',
 '2022-12-11 00:00:00',
 '2023-01-07 00:00:00',
 '2022-12-23 00:00:00',
 '2023-01-14 00:00:00',
 '2022-11-30 00:00:00',
 '2023-01-26 00:00:00',
 '2023-02-16 00:00:00',
 '2023-02-18 00:00:00',
 '2022-11-30 00:00:00',
 '2022-12-14 00:00:00',
 '2022-11-19 00:00:00',
 '2023-01-12 00:00:00',
 '2023-01-05 00:00:00',
 '2022-12-19 00:00:00',
 '2022-11-27 00:00:00',
 '2023-01-04 00:00:00',
 '2022-12-03 00:00:00',
 '2022-12-30 00:00:00',
 '2023-01-12 00:00:00',
 '2022-12-29 00:00:00',
 '2023-02-16 00:00:00',
 '2023-01-05 00:00:00',
 '2022-12-12 00:00:00',
 '2022-11-28 00:00:00',
 '2023-01-06 00:00:00',
 '2022-12-27 00:00:00',
 '2023-02-02 00:00:00']

In [51]:
medical_table['Mfg Date'] = Date_Of_Mfg

In [52]:
medical_table

               Mfg Date
0   2022-11-13 00:00:00
1   2023-01-03 00:00:00
2   2023-01-08 00:00:00
3   2022-11-30 00:00:00
4   2022-12-09 00:00:00
..                  ...
95  2022-12-12 00:00:00
96  2022-11-28 00:00:00
97  2023-01-06 00:00:00
98  2022-12-27 00:00:00
99  2023-02-02 00:00:00

[100 rows x 1 columns]

In [53]:
import re

In [88]:
alist = ['abc def','def ghi', 'ghi jkl']

In [105]:
# newlist = []
# for i in range(len(alist)):
#     alist[i]=re.sub('\s.+','',alist[i])
#     print(alist[i])
#     newlist.append(alist[i])
#     print(newlist)

In [91]:
def regex_func(value):
    return re.sub('\s.+','',value)

In [94]:
medical_table['Mfg Date'] = medical_table['Mfg Date'].apply(regex_func)

In [95]:
medical_table

      Mfg Date
0   2022-11-13
1   2023-01-03
2   2023-01-08
3   2022-11-30
4   2022-12-09
..         ...
95  2022-12-12
96  2022-11-28
97  2023-01-06
98  2022-12-27
99  2023-02-02

[100 rows x 1 columns]

In [97]:
import string

In [98]:
medicine_list = list(string.ascii_uppercase)
print(medicine_list)

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [102]:
ml = []
for i in range(len(medical_table)):
    ml.append(random.choice(medicine_list))

In [103]:
medical_table['Medicine'] = ml

In [104]:
medical_table

      Mfg Date Medicine
0   2022-11-13        S
1   2023-01-03        H
2   2023-01-08        B
3   2022-11-30        S
4   2022-12-09        W
..         ...      ...
95  2022-12-12        M
96  2022-11-28        V
97  2023-01-06        I
98  2022-12-27        Q
99  2023-02-02        W

[100 rows x 2 columns]

In [108]:
qty_range = list(range(1,15))

In [109]:
qty_range

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [110]:
qty = []
for i in range(len(medical_table)):
    qty.append(random.choice(qty_range))

In [111]:
medical_table['Lots Purchased'] = qty

In [112]:
medical_table

      Mfg Date Medicine  Lots Purchased
0   2022-11-13        S               6
1   2023-01-03        H              10
2   2023-01-08        B               9
3   2022-11-30        S               8
4   2022-12-09        W              10
..         ...      ...             ...
95  2022-12-12        M               1
96  2022-11-28        V               7
97  2023-01-06        I              12
98  2022-12-27        Q              12
99  2023-02-02        W               5

[100 rows x 3 columns]

In [113]:
lts = []
lts_range = [2,5,8,10]
for i in range(len(medical_table)):
    lts.append(random.choice(lts_range))

In [114]:
medical_table['Lot size'] = lts

In [118]:
medical_table

      Mfg Date Medicine  Lots Purchased  Lot size  Units purchased
0   2022-11-13        S               6         8               48
1   2023-01-03        H              10         5               50
2   2023-01-08        B               9        10               90
3   2022-11-30        S               8         2               16
4   2022-12-09        W              10         5               50
..         ...      ...             ...       ...              ...
95  2022-12-12        M               1         5                5
96  2022-11-28        V               7         5               35
97  2023-01-06        I              12         2               24
98  2022-12-27        Q              12         5               60
99  2023-02-02        W               5        10               50

[100 rows x 5 columns]

In [117]:
medical_table['Units purchased'] = pd.DataFrame(medical_table['Lots Purchased']*medical_table['Lot size'])

In [119]:
medical_table.describe(include='all')

          Mfg Date Medicine  Lots Purchased    Lot size  Units purchased
count          100      100      100.000000  100.000000       100.000000
unique          64       25             NaN         NaN              NaN
top     2023-01-05        E             NaN         NaN              NaN
freq             4        8             NaN         NaN              NaN
mean           NaN      NaN        7.660000    6.540000        50.090000
std            NaN      NaN        4.273999    3.003096        37.663608
min            NaN      NaN        1.000000    2.000000         2.000000
25%            NaN      NaN        4.000000    5.000000        16.000000
50%            NaN      NaN        7.500000    8.000000        48.000000
75%            NaN      NaN       12.000000   10.000000        70.500000
max            NaN      NaN       14.000000   10.000000       140.000000

#### Create expiry date column

In [121]:
expiry_date = pd.date_range('01/05/2024', periods=100, freq='D')

In [124]:
edl = expiry_date.to_list()

In [125]:
edl_str = []
for i in range(len(edl)):
    edl_str.append(str(edl[i]))

In [129]:
edls = []
for i in range(len(medical_table)):
    edls.append(random.choice(edl_str))

In [130]:
medical_table['Expiry Date'] = edls

In [168]:
medical_table

,Mfg Date,Medicine,Lots Purchased,Lot size,Units purchased,Expiry Date,Days to expiry
0,2022-11-13,S,6,8,48,2024-01-31,444 days
1,2023-01-03,H,10,5,50,2024-02-07,400 days
2,2023-01-08,B,9,10,90,2024-02-19,407 days
3,2022-11-30,S,8,2,16,2024-03-29,485 days
4,2022-12-09,W,10,5,50,2024-01-25,412 days
...,...,...,...,...,...,...,...
95,2022-12-12,M,1,5,5,2024-03-22,466 days
96,2022-11-28,V,7,5,35,2024-01-24,422 days
97,2023-01-06,I,12,2,24,2024-04-07,457 days
98,2022-12-27,Q,12,5,60,2024-01-26,395 days
99,2023-02-02,W,5,10,50,2024-03-07,399 days

In [132]:
medical_table['Expiry Date'] = medical_table['Expiry Date'].apply(regex_func)

## Date conversion operations

### Converting date string columns to datetime format

In [166]:
medical_table[['Expiry Date','Mfg Date']] = medical_table[['Expiry Date','Mfg Date']].apply(pd.to_datetime, errors='coerce')

In [ ]:
medical_table.info()

In [167]:
medical_table['Days to expiry'] = medical_table['Expiry Date'] - medical_table['Mfg Date']

### Converting date string to datetime format
#### Gets converted to YYYY-MM-DD

#### Converting 8 date formats to universal YYYY-MM-DD format

In [191]:
s1 = '2024-11-11'
s2 = '2024-11-19'
s3 = '2024/01/13'
s4 = '13/12/2025'
s5 = '10/18/2025'
s6 = '18-Mar-2023'
s7 = '18-March-2023'
s8 = 'Mar/18/2023'

In [174]:
import datetime as dt

In [192]:
date_string1 = dt.datetime.strptime(s1,"%Y-%m-%d")
date_string2 = dt.datetime.strptime(s2,"%Y-%m-%d")
date_string3 = dt.datetime.strptime(s3,"%Y/%m/%d")
date_string4 = dt.datetime.strptime(s4,"%d/%m/%Y")
date_string5 = dt.datetime.strptime(s5,"%m/%d/%Y")
date_string6 = dt.datetime.strptime(s6,"%d-%b-%Y")
date_string7 = dt.datetime.strptime(s7,"%d-%B-%Y")
date_string8 = dt.datetime.strptime(s8,"%b/%d/%Y")

print('Earlier:',s1,'Now:',date_string1)
print('Earlier:',s2,'Now:',date_string2)
print('Earlier:',s3,'Now:',date_string3)
print('Earlier:',s4,'Now:',date_string4)
print('Earlier:',s5,'Now:',date_string5)
print('Earlier:',s6,'Now:',date_string6)
print('Earlier:',s7,'Now:',date_string7)
print('Earlier:',s8,'Now:',date_string8)

Earlier: 2024-11-11 Now: 2024-11-11 00:00:00
Earlier: 2024-11-19 Now: 2024-11-19 00:00:00
Earlier: 2024/01/13 Now: 2024-01-13 00:00:00
Earlier: 13/12/2025 Now: 2025-12-13 00:00:00
Earlier: 10/18/2025 Now: 2025-10-18 00:00:00
Earlier: 18-Mar-2023 Now: 2023-03-18 00:00:00
Earlier: 18-March-2023 Now: 2023-03-18 00:00:00
Earlier: Mar/18/2023 Now: 2023-03-18 00:00:00

#### Creating a datetime object

In [188]:
xyz = dt.datetime(2025,12,11)